Project/Toir/src/Reports/гкс_ОтчетПоЗаявкам/гкс_ОтчетПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_ОтчетПоЗаявкам</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_СтатусыРемонтовВЗаявках/торо_СтатусыРемонтовВЗаявках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтовВЗаявках</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКСтатусу</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРемонт</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СтоимостьЧасаКвалификации/торо_СтоимостьЧасаКвалификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтоимостьЧасаКвалификации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Обслуживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Reports/гкс_ОтчетПоЗаявкам/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаНачала = НачалоГода(ТекущаяДата());
	ДатаОкончания = КонецГода(ТекущаяДата());
	МассивПодр = Новый Массив();
	МассивОрг = Новый Массив();
	ВидЦены = Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта.Получить();
	
	ПараметрНачала = Новый ПараметрКомпоновкиДанных("ДатаНачала");
	ПараметрОкончания = Новый ПараметрКомпоновкиДанных("ДатаОкончания");
	ПараметрОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	ПараметрПодразделение = Новый ПараметрКомпоновкиДанных("Подразделение");
	ПараметрПериодОтчета = Новый ПараметрКомпоновкиДанных("ПериодОтчета");
	ПараметрВидЦены = Новый ПараметрКомпоновкиДанных("ВидЦены");
	
	
	Для Каждого СМ Из Настройки.ПараметрыДанных.Элементы Цикл
		Если СМ.Использование = Истина Тогда
			Если СМ.Параметр = ПараметрОрганизация Тогда 
				Если ТипЗнч(СМ.Значение) = Тип("СписокЗначений") Тогда 
					Для Каждого СтрокаСписка Из СМ.Значение Цикл
						МассивОрг.Добавить(СтрокаСписка.Значение);
					КонецЦикла;
				Иначе
					МассивОрг.Добавить(СМ.Значение);
				КонецЕсли;
			КонецЕсли;
			Если СМ.Параметр = ПараметрПодразделение Тогда 
				Если ТипЗнч(СМ.Значение) = Тип("СписокЗначений") Тогда 
					Для Каждого СтрокаСписка Из СМ.Значение Цикл
						МассивПодр.Добавить(СтрокаСписка.Значение);
					КонецЦикла;
				Иначе
					МассивПодр.Добавить(СМ.Значение);
				КонецЕсли;
			КонецЕсли;
			Если СМ.Параметр = ПараметрВидЦены Тогда 
				ВидЦены = СМ.Значение;
			КонецЕсли;
			Если СМ.Параметр = ПараметрНачала Тогда 
				ДатаНачала = СМ.Значение.Дата;
			КонецЕсли;
			Если СМ.Параметр = ПараметрОкончания Тогда 
				ДатаОкончания = СМ.Значение.Дата;
			КонецЕсли;
			Если СМ.Параметр = ПараметрПериодОтчета Тогда 
				ДатаОкончания = СМ.Значение.ДатаОкончания;
				ДатаНачала = СМ.Значение.ДатаНачала;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	ВнешниеНаборыДанных = Новый Структура;
	ТЧРезультат = ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, МассивОрг, МассивПодр);
	ВнешниеНаборыДанных.Вставить("ВТ_Данные", ТЧРезультат);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);	
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Функция ПолучитьТаблицуДанных(ДатаНачала, ДатаОкончания, МассивОрг, МассивПодр)
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапроса(МассивПодр.Количество(), МассивОрг.Количество());
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("МассивОрг", МассивОрг);
	Запрос.УстановитьПараметр("МассивПодр", МассивПодр);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПервыйПакет = 10;
	ВторойПакет = ПервыйПакет + 1;
	ТретийПакет = ВторойПакет + 1;
	ЧетПакет = ТретийПакет + 4;
	ПятыйПакет = ЧетПакет + 1;
	ШестПакет = ПятыйПакет + 1;
	СемПакет = ШестПакет + 1;
	ВосьПакет = СемПакет + 1;
	ДевятыйПакет = ВосьПакет + 1;
	
	ТЧ_Результат = РезультатЗапроса[ПервыйПакет].Выгрузить();
	ВыборкаРР = РезультатЗапроса[ВторойПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЗ = РезультатЗапроса[ТретийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗ = РезультатЗапроса[ЧетПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсп = РезультатЗапроса[ПятыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРРАкт = РезультатЗапроса[ШестПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЗАкт = РезультатЗапроса[СемПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМЗАкт = РезультатЗапроса[ВосьПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИспАкт = РезультатЗапроса[ДевятыйПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЧ_Результат.Колонки.Добавить("КоличествоЧЧ", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(15,2)));
		ТЧ_Результат.Колонки.Добавить("ФактКоличествоЧЧ", Новый ОписаниеТипов("Число",,, 
		Новый КвалификаторыЧисла(15,2)));
	ТЧ_Результат.Колонки.Добавить("ОписаниеПлановыхРаботЗаявки", Новый ОписаниеТипов("Строка"));
	ТЧ_Результат.Колонки.Добавить("ОписаниеФактическиВыполненныхРабот", Новый ОписаниеТипов("Строка"));
	ТипИсполнитель = Новый Массив();
	ТипИсполнитель.Добавить(Тип("СправочникСсылка.Контрагенты"));
	ТипИсполнитель.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
	ТЧ_Результат.Колонки.Добавить("ИсполнительЗаявки", Новый ОписаниеТипов(ТипИсполнитель));
	ТЧ_Результат.Колонки.Добавить("ИсполнительАкта", Новый ОписаниеТипов(ТипИсполнитель));
	
	Для Каждого СТ Из ТЧ_Результат Цикл
		СтруктПоиска = Новый Структура("Ид_Ремонта", СТ.Ид_Ремонта);
		СтруктПоискаАкта = Новый Структура("Ид_Ремонта,Акт", СТ.Ид_Ремонта, СТ.Акт);
		СтруктПоискаЗаявки = Новый Структура("Заявка", СТ.Заявка);
		ВыборкаРР.Сбросить();
		Если ВыборкаРР.НайтиСледующий(СтруктПоиска) Тогда 
			МассивТекста = Новый Массив();
			ВыборкаРР0 = ВыборкаРР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаРР0.НайтиСледующий(СтруктПоискаЗаявки) Тогда 
				Выборка = ВыборкаРР0.Выбрать();
				Пока Выборка.Следующий() Цикл
					МассивТекста.Добавить(Строка(Выборка.РР));
				КонецЦикла;
			КонецЕсли;
			СТ.ОписаниеПлановыхРаботЗаявки = СтрСоединить(МассивТекста, ", ");
		КонецЕсли;
		//
		ВыборкаТЗ.Сбросить();
		Если ВыборкаТЗ.НайтиСледующий(СтруктПоиска) Тогда 
			ТекСумма = 0;
			СуммаКвалификаций = 0;
			ВыборкаТЗ0 = ВыборкаТЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаТЗ0.НайтиСледующий(СтруктПоискаЗаявки) Тогда 
				Выборка = ВыборкаТЗ0.Выбрать();
				Пока Выборка.Следующий() Цикл
					СуммаКвалификаций = СуммаКвалификаций + (Выборка.СуммаВремени * Выборка.Цена);
					ТекСумма = ТекСумма + Выборка.СуммаВремени;
				КонецЦикла;
			КонецЕсли;
			СТ.КоличествоЧЧ = ТекСумма;
			СТ.ПлановаяСтоимостьЗаявки = СТ.ПлановаяСтоимостьЗаявки + СуммаКвалификаций;
			Если СТ.КоличествоЧЧ > 0 Тогда 
				СТ.СтоимостьЧЧ = СуммаКвалификаций / СТ.КоличествоЧЧ;
			КонецЕсли;
		КонецЕсли;
		//
		ВыборкаМЗ.Сбросить();
		Если ВыборкаМЗ.НайтиСледующий(СтруктПоиска) Тогда 
			ТекСумма = 0;
			ВыборкаМЗ0 = ВыборкаМЗ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаМЗ0.НайтиСледующий(СтруктПоискаЗаявки) Тогда 
				Выборка = ВыборкаМЗ0.Выбрать();
				Пока Выборка.Следующий() Цикл
					ТекСумма = ТекСумма + Выборка.Количество * Выборка.Цена;
				КонецЦикла;
			КонецЕсли;
			СТ.СтоимостьМатериалов = ТекСумма;
			СТ.ПлановаяСтоимостьЗаявки = СТ.ПлановаяСтоимостьЗаявки + ТекСумма;
		КонецЕсли;
		//
		ВыборкаИсп.Сбросить();
		Если ВыборкаИсп.НайтиСледующий(СтруктПоиска) Тогда   //
			ПервыйКонтрагент = Неопределено;
			ВыборкаИсп0 = ВыборкаИсп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаИсп0.НайтиСледующий(СтруктПоискаЗаявки) Тогда
				Выборка = ВыборкаИсп0.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ПервыйКонтрагент = Неопределено Тогда 
						ПервыйКонтрагент = Выборка.Исполнитель;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			СТ.ИсполнительЗаявки = ПервыйКонтрагент;
		КонецЕсли;
		//
		ВыборкаИспАкт.Сбросить();
		Если ВыборкаИспАкт.НайтиСледующий(СтруктПоиска) Тогда 
			ПервыйКонтрагент = Неопределено;
			ВыборкаИспАкт0 = ВыборкаИспАкт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаИспАкт0.НайтиСледующий(СтруктПоискаАкта) Тогда 
				Выборка = ВыборкаИспАкт0.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если ПервыйКонтрагент = Неопределено Тогда 
						ПервыйКонтрагент = Выборка.Исполнитель;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			СТ.ИсполнительАкта = ПервыйКонтрагент;
		КонецЕсли;
		//
		ВыборкаРРАкт.Сбросить();
		Если ВыборкаРРАкт.НайтиСледующий(СтруктПоиска) Тогда 
			МассивТекста = Новый Массив();
			ВыборкаРРАкт0 = ВыборкаРРАкт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаРРАкт0.НайтиСледующий(СтруктПоискаАкта) Тогда 
				Выборка = ВыборкаРРАкт0.Выбрать();
				Пока Выборка.Следующий() Цикл
					МассивТекста.Добавить(Строка(Выборка.РР));
				КонецЦикла;
			КонецЕсли;
			СТ.ОписаниеФактическиВыполненныхРабот = СтрСоединить(МассивТекста, ", ");
		КонецЕсли;
		//
		ВыборкаТЗАкт.Сбросить();
		Если ВыборкаТЗАкт.НайтиСледующий(СтруктПоиска) Тогда 
			ТекСумма = 0;
			СуммаКвалификаций = 0;
			ВыборкаТЗАкт0 = ВыборкаТЗАкт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаТЗАкт0.НайтиСледующий(СтруктПоискаАкта) Тогда 
				Выборка = ВыборкаТЗАкт0.Выбрать();
				Пока Выборка.Следующий() Цикл
					ТекСумма = ТекСумма + Выборка.СуммаВремени;
					СуммаКвалификаций = СуммаКвалификаций + (Выборка.СуммаВремени * Выборка.Цена);
				КонецЦикла;
			КонецЕсли;
			СТ.ФактическаяСтоимостьРабот = СТ.ФактическаяСтоимостьРабот + СуммаКвалификаций;
			СТ.ФактКоличествоЧЧ = ТекСумма;
			Если СТ.ФактКоличествоЧЧ > 0 Тогда 
				СТ.ФактСтоимостьЧЧ = СуммаКвалификаций / СТ.ФактКоличествоЧЧ;
			КонецЕсли;
		КонецЕсли;
		//
		ВыборкаМЗАкт.Сбросить();
		Если ВыборкаМЗАкт.НайтиСледующий(СтруктПоиска) Тогда 
			ТекСумма = 0;
			ВыборкаМЗАкт0 = ВыборкаМЗАкт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаМЗАкт0.НайтиСледующий(СтруктПоискаАкта) Тогда 
				Выборка = ВыборкаМЗАкт0.Выбрать();
				Пока Выборка.Следующий() Цикл
					ТекСумма = ТекСумма + Выборка.Количество * Выборка.Цена;
				КонецЦикла;
			КонецЕсли;
			СТ.ФактСтоимостьМатериалов = ТекСумма;
			СТ.ФактическаяСтоимостьРабот = СТ.ФактическаяСтоимостьРабот + ТекСумма;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЧ_Результат;
КонецФункции

Функция ПолучитьТекстЗапроса(ОтборПодразделение = Ложь, ОтборОрганизация = Ложь)
	Возврат 
	"ВЫБРАТЬ Различные
	   |	РегДок.Ссылка КАК Ссылка,
	   |	РегДок.ID КАК Ид_Ремонта
	   |ПОМЕСТИТЬ Заявки
	   |ИЗ
	   |	Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования  КАК РегДок
	   |Где
        |				РегДок.Ссылка.Дата >= &ДатаНачала
        |				И РегДок.Ссылка.Дата < &ДатаОкончания
        |	 "
+ ?(ОтборОрганизация, " И РегДок.Ссылка.Организация В (&МассивОрг) ", "")
+ ?(ОтборПодразделение, " И РегДок.Ссылка.Подразделение В (&МассивПодр) ", "")
+ "
	   | " + " ; " 
+ "ВЫБРАТЬ
  |	ТЧ.Ид_Ремонта КАК Ид_Ремонта,
  |	ДокументыОснования.ДокументОснование КАК ДокументОснование
  |ПОМЕСТИТЬ ОснованияЗаявок
  |ИЗ
  |	Заявки КАК ТЧ
  |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ДокументыОснования КАК ДокументыОснования
  |		ПО ТЧ.Ссылка = ДокументыОснования.Ссылка
  |			И (ДокументыОснования.НомерСтроки = 1)
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	АктТЧ.Ссылка КАК Ссылка,
  |	АктТЧ.ДатаНачала КАК ДатаНачалаФакт,
  |	АктТЧ.ДатаОкончания КАК ДатаЗавершенияФакт
  |ПОМЕСТИТЬ Акты
  |ИЗ
  |	Заявки КАК РегДок
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК АктТЧ
  |		ПО (АктТЧ.ID = РегДок.Ид_Ремонта)
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	Заявки.Ссылка КАК Заявка,
  |	Акты.Ссылка КАК Акт
  |ПОМЕСТИТЬ СоотАктыЗаявок
  |ИЗ
  |	Заявки КАК Заявки
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК Основания
  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Акты КАК Акты
  |			ПО Основания.Ссылка = Акты.Ссылка
  |		ПО Заявки.Ссылка = Основания.ДокументОснование
  |
  |ОБЪЕДИНИТЬ ВСЕ
  |
  |ВЫБРАТЬ РАЗЛИЧНЫЕ
  |	Заявки.Ссылка,
  |	Акты.Ссылка
  |ИЗ
  |	Заявки КАК Заявки
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК Наряды
  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ДокументыОснования КАК Основания
  |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Акты КАК Акты
  |				ПО Основания.Ссылка = Акты.Ссылка
  |			ПО Наряды.Ссылка = Основания.ДокументОснование
  |		ПО Заявки.Ссылка = Наряды.ДокументОснование
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	ОснованияЗаявок.Ид_Ремонта КАК Ид_Ремонта,
  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка) КАК Колво
  |ПОМЕСТИТЬ КПФОснований
  |ИЗ
  |	ОснованияЗаявок КАК ОснованияЗаявок
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ВнешнееОснованиеДляРаботПрисоединенныеФайлы КАК Файлы
  |		ПО ОснованияЗаявок.ДокументОснование = Файлы.ВладелецФайла
  |ГДЕ
  |	Файлы.ЭтоГруппа = ЛОЖЬ
  |
  |СГРУППИРОВАТЬ ПО
  |	ОснованияЗаявок.Ид_Ремонта
  |
  |ОБЪЕДИНИТЬ ВСЕ
  |
  |ВЫБРАТЬ
  |	ОснованияЗаявок.Ид_Ремонта,
  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка)
  |ИЗ
  |	ОснованияЗаявок КАК ОснованияЗаявок
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ВыявленныеДефектыПрисоединенныеФайлы КАК Файлы
  |		ПО ОснованияЗаявок.ДокументОснование = Файлы.ВладелецФайла
  |ГДЕ
  |	Файлы.ЭтоГруппа = ЛОЖЬ
  |
  |СГРУППИРОВАТЬ ПО
  |	ОснованияЗаявок.Ид_Ремонта
  |
  |ОБЪЕДИНИТЬ ВСЕ
  |
  |ВЫБРАТЬ
  |	ОснованияЗаявок.Ид_Ремонта,
  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка)
  |ИЗ
  |	ОснованияЗаявок КАК ОснованияЗаявок
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ПланГрафикРемонтаПрисоединенныеФайлы КАК Файлы
  |		ПО ОснованияЗаявок.ДокументОснование = Файлы.ВладелецФайла
  |ГДЕ
  |	Файлы.ЭтоГруппа = ЛОЖЬ
  |
  |СГРУППИРОВАТЬ ПО
  |	ОснованияЗаявок.Ид_Ремонта
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	Акты.Ссылка КАК Ссылка,
  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка) КАК Колво
  |ПОМЕСТИТЬ КПФАктов
  |ИЗ
  |	Акты КАК Акты
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_АктОВыполненииЭтапаРаботПрисоединенныеФайлы КАК Файлы
  |		ПО Акты.Ссылка = Файлы.ВладелецФайла
  |ГДЕ
  |	Файлы.ЭтоГруппа = ЛОЖЬ
  |
  |СГРУППИРОВАТЬ ПО
  |	Акты.Ссылка
  |;
  |
  |////////////////////////////////////////////////////////////////////////////////
  |ВЫБРАТЬ
  |	Заявки.Ссылка КАК Ссылка,
  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Файлы.Ссылка) КАК Колво
  |ПОМЕСТИТЬ КПФЗаявок
  |ИЗ
  |	Заявки КАК Заявки
  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ЗаявкаНаРемонтПрисоединенныеФайлы КАК Файлы
  |		ПО Заявки.Ссылка = Файлы.ВладелецФайла
  |ГДЕ
  |	Файлы.ЭтоГруппа = ЛОЖЬ
  |
  |СГРУППИРОВАТЬ ПО
  |	Заявки.Ссылка" + " ; " +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	РегДок.Ссылка КАК Регистратор,
	        |	РегДок.Ид_Ремонта КАК Ид_Ремонта,
	        |	ЕСТЬNULL(Статусы.Статус, ЗНАЧЕНИЕ(Перечисление.торо_СтатусыДокументов.ПустаяСсылка)) КАК Статус,
	        |	Завершенные.Ссылка КАК Акт,
	        |	Завершенные.ДатаНачалаФакт КАК ДатаНачалаФакт,
	        |	Завершенные.ДатаЗавершенияФакт КАК ДатаЗавершенияФакт
	        |ПОМЕСТИТЬ ВсеЗаявки
	        |ИЗ
	        |	Заявки КАК РегДок
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(, ) КАК Статусы
	        |		ПО (Статусы.ИДРемонта = РегДок.Ид_Ремонта)
	        |			И (Статусы.ЗаявкаНаРемонт = РегДок.Ссылка)
			|		Левое соединение СоотАктыЗаявок КАК СоотАктыЗаявок
			|			ЛЕВОЕ СОЕДИНЕНИЕ Акты КАК Завершенные
	        |			ПО Завершенные.Ссылка = СоотАктыЗаявок.Акт
			|		ПО СоотАктыЗаявок.Заявка = РегДок.Ссылка
	        
	        | " + " ; " + "
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Регистратор КАК Регистратор,
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
			// гкс+ [разработка 2021] Куст 09.07.2021
			|	СУММА(ТЧ.ВремяРаботы * ТЧ.Количество * ЕСТЬNULL(ТЧ2.гкс_ПовКоэф.Коэффициент, 1)) КАК СуммаВремени,
			// гкс- [разработка 2021] Куст 09.07.2021
	        |	СУММА(ТЧ.ВремяРаботы) КАК ВремяРаботы,
	        |	СУММА(ТЧ.Количество) КАК Количество,
	        |	ТЧ.Квалификация КАК Квалификация,
	        |	0 КАК ТипДокумента
	        |ПОМЕСТИТЬ ВсеТрудозатраты
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ТрудовыеЗатраты КАК ТЧ
			// гкс+ [разработка 2021] Куст 09.07.2021
			|			Левое СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ТЧ2
	        |			ПО ТЧ2.Ссылка = ТЧ.Ссылка
	        |			И ТЧ2.РемонтыОборудования_ID = ТЧ.РемонтыОборудования_ID
			|			И ТЧ2.ID = ТЧ.ID
			// гкс- [разработка 2021] Куст 09.07.2021
	        |		ПО ВсеЗаявки.Регистратор = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеЗаявки.Регистратор,
	        |	ВсеЗаявки.Ид_Ремонта,
	        |	ТЧ.Квалификация
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Акт,
	        |	ВсеЗаявки.Ид_Ремонта,
			// гкс+ [разработка 2021] Куст 09.07.2021
			|	СУММА(ТЧ.ВремяРаботы * ТЧ.гкс_Количество * ЕСТЬNULL(ТЧ2.гкс_ПовКоэф.Коэффициент, 1)) КАК СуммаВремени,
			// гкс- [разработка 2021] Куст 09.07.2021
	        |	СУММА(ТЧ.ВремяРаботы),
	        |	СУММА(ТЧ.гкс_Количество),
	        |	ТЧ.Квалификация,
	        |	1
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ТрудовыеЗатраты КАК ТЧ
			// гкс+ [разработка 2021] Куст 09.07.2021
			|			Левое СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ТЧ2
	        |			ПО ТЧ2.Ссылка = ТЧ.Ссылка
	        |			И ТЧ2.РемонтыОборудования_ID = ТЧ.РемонтыОборудования_ID
			|			И ТЧ2.ID = ТЧ.ID
			// гкс- [разработка 2021] Куст 09.07.2021
	        |		ПО ВсеЗаявки.Акт = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеЗаявки.Акт,
	        |	ВсеЗаявки.Ид_Ремонта,
	        |	ТЧ.Квалификация
	        |; 	        
			|
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеТрудозатраты.Регистратор КАК Регистратор,
	        |	ВсеТрудозатраты.Ид_Ремонта КАК Ид_Ремонта,
	        |	МАКСИМУМ(Рег.Период) КАК Период, 
	        |	Рег.Квалификация КАК Квалификация
	        |ПОМЕСТИТЬ СрезКвалификаций
	        |ИЗ
	        |	ВсеТрудозатраты КАК ВсеТрудозатраты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК Рег
	        |		ПО ВсеТрудозатраты.Квалификация = Рег.Квалификация
			|			И ВсеТрудозатраты.Регистратор.Организация = Рег.Организация
	        |			И ВсеТрудозатраты.Регистратор.Дата >= Рег.Период
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеТрудозатраты.Регистратор,
	        |	ВсеТрудозатраты.Ид_Ремонта,
	        |	Рег.Квалификация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Регистратор КАК Заявка,
	        |	ВсеЗаявки.Статус КАК Статус,
	        |	ВсеЗаявки.Регистратор.Дата КАК ДатаЗаявки,
	        |	ВсеЗаявки.Регистратор.Номер КАК НомерЗаявки,
	        |	ВсеЗаявки.Регистратор.Организация КАК Организация,
			|	ВсеЗаявки.Регистратор.Подразделение КАК Подразделение,
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
			|	ВсеЗаявки.Акт КАК Акт,
			|	ВсеЗаявки.Акт.Дата КАК ДатаАкта,
			|	ВсеЗаявки.Акт.Номер КАК НомерАкта,
	        |	ТЧ.ДатаНачала КАК ДатаНачалаПлан,
	        |	ТЧ.ДатаОкончания КАК ДатаОкончанияПлан,
	        |	0 КАК ФактическаяСтоимостьРабот,
	        |	0 КАК ПлановаяСтоимостьЗаявки,
	        |	КПФОснований.Колво КАК КВФОснование,
	        |	КПФЗаявок.Колво КАК КВФЗаявка,
			|	КПФАктов.Колво КАК КВФАкт,
	        |	0 КАК СтоимостьМатериалов,
	        |	0 КАК ФактСтоимостьМатериалов,
	        |	0 КАК СтоимостьЧЧ,
	        |	0 КАК ФактСтоимостьЧЧ,
			|	ВсеЗаявки.Регистратор.Организация.гкс_ВидЦены.ВалютаЦены КАК Валюта,
	        |	ВсеЗаявки.Регистратор.Ответственный КАК Инициатор,
	        |	ВсеЗаявки.Регистратор.гкс_ПлановаяСтоимостьРемонта КАК ПлановаяСтоимостьРемонта,
	        |	ТЧ.ОбъектРемонта КАК ОбъектРемонта,
	        |	ВсеЗаявки.ДатаНачалаФакт КАК ДатаНачалаФакт,
	        |	ВсеЗаявки.ДатаЗавершенияФакт КАК ДатаЗавершенияФакт,
	        |	ТЧ.ВидРемонтныхРабот КАК ВидРемонта,
	        |	ТЧ.ВидРемонтныхРабот.гкс_ТипРабот КАК Кодировка,
	        |	ТЧ.ВидРемонтныхРабот.Родитель КАК ТипРабот
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
			|		Левое соединение КПФОснований КАК КПФОснований
			|		ПО КПФОснований.Ид_Ремонта = ВсеЗаявки.Ид_Ремонта
			|		Левое соединение КПФЗаявок КАК КПФЗаявок
			|		ПО ВсеЗаявки.Регистратор = КПФЗаявок.Ссылка
			|		Левое соединение КПФАктов КАК КПФАктов
			|		ПО ВсеЗаявки.Акт = КПФАктов.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ТЧ
	        |		ПО ВсеЗаявки.Регистратор = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.ID
			|Упорядочить По ВсеЗаявки.Регистратор.Дата"
+ " ; " + "
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Регистратор КАК Заявка,
	        |	ТЧ.РемонтнаяРабота КАК РР,
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ТЧ
	        |		ПО ВсеЗаявки.Регистратор = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |			И (ТЧ.РемонтнаяРабота ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Заявка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеТрудозатраты.Регистратор КАК Заявка,
	        |	ВсеТрудозатраты.Ид_Ремонта КАК Ид_Ремонта,
			|	ЕстьNull(ВсеТрудозатраты.СуммаВремени, 0) / 3600 КАК СуммаВремени,
	        |	ЕстьNull(ВсеТрудозатраты.ВремяРаботы,0) КАК ВремяРаботы,
	        |	ЕстьNull(ВсеТрудозатраты.Количество,0) КАК Количество,
	        |	ЕстьNull(Рег.Стоимость, 0) КАК Цена
	        |ИЗ
	        |	ВсеТрудозатраты КАК ВсеТрудозатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СрезКвалификаций КАК СрезКвалификаций
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК Рег
	        |			ПО СрезКвалификаций.Квалификация = Рег.Квалификация
			|				И СрезКвалификаций.Регистратор.Организация = Рег.Организация
	        |				И СрезКвалификаций.Период = Рег.Период
	        |		ПО (СрезКвалификаций.Квалификация = ВсеТрудозатраты.Квалификация)
	        |			И (СрезКвалификаций.Регистратор = ВсеТрудозатраты.Регистратор)
	        |			И (СрезКвалификаций.Ид_Ремонта = ВсеТрудозатраты.Ид_Ремонта)
	        |ГДЕ
	        |	ВсеТрудозатраты.ТипДокумента = 0
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Заявка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЦеныНоменклатуры.Период КАК Период,
	        |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	        |	ЦеныНоменклатуры.ВидЦены КАК ВидЦены,
	        |	ЦеныНоменклатуры.Цена КАК Цена,
			|	ЦеныНоменклатуры.Валюта КАК Валюта
	        |ПОМЕСТИТЬ ВсеЦены
	        |ИЗ
	        |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Регистратор КАК Регистратор,
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
	        |	ТЧ.Номенклатура КАК Номенклатура,
			// гкс+ [разработка 2021] Куст 09.07.2021
	        |	СУММА(ТЧ.КоличествоЕдиниц * ЕСТЬNULL(ТЧ2.гкс_ПовКоэф.Коэффициент, 1)) КАК Количество,
			// гкс- [разработка 2021] Куст 09.07.2021
	        |	0 КАК ТипДокумента
	        |ПОМЕСТИТЬ ВсеМатЗатраты
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.МатериальныеЗатраты КАК ТЧ
			// гкс+ [разработка 2021] Куст 09.07.2021
			|			Левое СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтныеРаботы КАК ТЧ2
	        |			ПО ТЧ2.Ссылка = ТЧ.Ссылка
	        |			И ТЧ2.РемонтыОборудования_ID = ТЧ.РемонтыОборудования_ID
			|			И ТЧ2.ID = ТЧ.ID
			// гкс- [разработка 2021] Куст 09.07.2021
	        |		ПО ВсеЗаявки.Регистратор = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеЗаявки.Регистратор,
	        |	ВсеЗаявки.Ид_Ремонта,
	        |	ТЧ.Номенклатура
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Акт,
	        |	ВсеЗаявки.Ид_Ремонта,
	        |	ТЧ.Номенклатура,
			// гкс+ [разработка 2021] Куст 09.07.2021
	        |	СУММА(ТЧ.КоличествоЕдиниц * ЕСТЬNULL(ТЧ2.гкс_ПовКоэф.Коэффициент, 1)),
			// гкс- [разработка 2021] Куст 09.07.2021
	        |	1
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК ТЧ
			// гкс+ [разработка 2021] Куст 09.07.2021
			|			Левое СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК ТЧ2
	        |			ПО ТЧ2.Ссылка = ТЧ.Ссылка
	        |			И ТЧ2.РемонтыОборудования_ID = ТЧ.РемонтыОборудования_ID
			|			И ТЧ2.ID = ТЧ.ID
			// гкс- [разработка 2021] Куст 09.07.2021
	        |		ПО ВсеЗаявки.Акт = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеЗаявки.Ид_Ремонта,
	        |	ТЧ.Номенклатура,
	        |	ВсеЗаявки.Акт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеМатЗатраты.Ид_Ремонта КАК Ид_Ремонта,
	        |	ВсеМатЗатраты.Номенклатура КАК Номенклатура,
	        |	МАКСИМУМ(ВсеЦены.Период) КАК Период,
	        |	ВсеМатЗатраты.Регистратор КАК Регистратор
	        |ПОМЕСТИТЬ СрезЦенМатЗатрат
	        |ИЗ
	        |	ВсеМатЗатраты КАК ВсеМатЗатраты
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЦены КАК ВсеЦены
	        |		ПО ВсеМатЗатраты.Номенклатура = ВсеЦены.Номенклатура
	        |			И ВсеМатЗатраты.Регистратор.Дата >= ВсеЦены.Период
			|			И ВсеМатЗатраты.Регистратор.Организация.гкс_ВидЦены = ВсеЦены.ВидЦены
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВсеМатЗатраты.Ид_Ремонта,
	        |	ВсеМатЗатраты.Номенклатура,
	        |	ВсеМатЗатраты.Регистратор
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеМатЗатраты.Ид_Ремонта КАК Ид_Ремонта,
			|	ВсеМатЗатраты.Регистратор КАК Заявка,
	        |	ВсеМатЗатраты.Номенклатура КАК Номенклатура,
	        |	ЕстьNull(ВсеМатЗатраты.Количество, 0) КАК Количество,
	        |	ЕстьNull(ВсеЦены.Цена, 0) КАК Цена,
	        |	ВсеЦены.Валюта КАК Валюта
	        |ИЗ
	        |	ВсеМатЗатраты КАК ВсеМатЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СрезЦенМатЗатрат КАК СрезЦенМатЗатрат
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЦены КАК ВсеЦены
	        |			ПО СрезЦенМатЗатрат.Номенклатура = ВсеЦены.Номенклатура
	        |				И СрезЦенМатЗатрат.Период = ВсеЦены.Период
			|			И СрезЦенМатЗатрат.Регистратор.Организация.гкс_ВидЦены = ВсеЦены.ВидЦены
	        |		ПО ВсеМатЗатраты.Номенклатура = СрезЦенМатЗатрат.Номенклатура
	        |			И ВсеМатЗатраты.Ид_Ремонта = СрезЦенМатЗатрат.Ид_Ремонта
	        |			И ВсеМатЗатраты.Регистратор = СрезЦенМатЗатрат.Регистратор
	        |ГДЕ
	        |	ВсеМатЗатраты.ТипДокумента = 0
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Заявка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
			|	ВсеЗаявки.Регистратор КАК Заявка,
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
	        |	ТЧ.Исполнитель КАК Исполнитель,
	        |	ТЧ.НомерСтроки КАК НомерСтроки
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.ИсполнителиПоРемонтам КАК ТЧ
	        |		ПО ВсеЗаявки.Регистратор = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	НомерСтроки
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Заявка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
			|	ВсеЗаявки.Акт КАК Акт,
	        |	ТЧ.РемонтнаяРабота КАК РР
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК ТЧ
	        |		ПО ВсеЗаявки.Акт = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |			И (ТЧ.РемонтнаяРабота ССЫЛКА Справочник.торо_ИдентификаторыТехКарт)
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Акт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеТрудозатраты.Регистратор КАК Акт,
	        |	ВсеТрудозатраты.Ид_Ремонта КАК Ид_Ремонта,
			|	ЕстьNull(ВсеТрудозатраты.СуммаВремени,0) / 3600 КАК СуммаВремени,
	        |	ЕстьNull(ВсеТрудозатраты.ВремяРаботы, 0) КАК ВремяРаботы,
	        |	ЕстьNull(ВсеТрудозатраты.Количество, 0) КАК Количество,
	        |	ЕстьNull(Рег.Стоимость, 0) КАК Цена
	        |ИЗ
	        |	ВсеТрудозатраты КАК ВсеТрудозатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СрезКвалификаций КАК СрезКвалификаций
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтоимостьЧасаКвалификации КАК Рег
	        |			ПО СрезКвалификаций.Квалификация = Рег.Квалификация
			|				И СрезКвалификаций.Регистратор.Организация = Рег.Организация
	        |				И СрезКвалификаций.Период = Рег.Период
	        |		ПО (СрезКвалификаций.Квалификация = ВсеТрудозатраты.Квалификация)
	        |			И (СрезКвалификаций.Регистратор = ВсеТрудозатраты.Регистратор)
	        |			И (СрезКвалификаций.Ид_Ремонта = ВсеТрудозатраты.Ид_Ремонта)
	        |ГДЕ
	        |	ВсеТрудозатраты.ТипДокумента = 1
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Акт
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
			|	ВсеМатЗатраты.Регистратор КАК Акт,
	        |	ВсеМатЗатраты.Ид_Ремонта КАК Ид_Ремонта,
	        |	ВсеМатЗатраты.Номенклатура КАК Номенклатура,
	        |	ЕстьNull(ВсеМатЗатраты.Количество, 0) КАК Количество,
	        |	ЕстьNull(ВсеЦены.Цена, 0) КАК Цена,
	        |	ВсеЦены.Валюта КАК Валюта
	        |ИЗ
	        |	ВсеМатЗатраты КАК ВсеМатЗатраты
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СрезЦенМатЗатрат КАК СрезЦенМатЗатрат
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеЦены КАК ВсеЦены
	        |			ПО СрезЦенМатЗатрат.Номенклатура = ВсеЦены.Номенклатура
	        |				И СрезЦенМатЗатрат.Период = ВсеЦены.Период
			|			И СрезЦенМатЗатрат.Регистратор.Организация.гкс_ВидЦены = ВсеЦены.ВидЦены
	        |		ПО ВсеМатЗатраты.Номенклатура = СрезЦенМатЗатрат.Номенклатура
	        |			И ВсеМатЗатраты.Ид_Ремонта = СрезЦенМатЗатрат.Ид_Ремонта
	        |			И ВсеМатЗатраты.Регистратор = СрезЦенМатЗатрат.Регистратор
	        |ГДЕ
	        |	ВсеМатЗатраты.ТипДокумента = 1
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Акт
			|;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеЗаявки.Ид_Ремонта КАК Ид_Ремонта,
			|	ТЧ.Ссылка КАК Акт,
	        |	ТЧ.Исполнитель КАК Исполнитель,
	        |	ТЧ.НомерСтроки КАК НомерСтроки
	        |ИЗ
	        |	ВсеЗаявки КАК ВсеЗаявки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.ИсполнителиПоРемонтам КАК ТЧ
	        |		ПО ВсеЗаявки.Акт = ТЧ.Ссылка
	        |			И ВсеЗаявки.Ид_Ремонта = ТЧ.РемонтыОборудования_ID
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	НомерСтроки
	        |ИТОГИ ПО
	        |	Ид_Ремонта, Акт";
КонецФункции
